InformationRegisters/ШаблоныНазванийДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныНазванийДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрНазвания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Стадия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаВыбораНазванияДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ШаблоныНазванийДокументов.НазваниеДокумента КАК НазваниеДокумента
	               |ИЗ
	               |	РегистрСведений.ШаблоныНазванийДокументов КАК ШаблоныНазванийДокументов";
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокНазванийДокументов = Элементы.НазваниеДокумента.СписокВыбора;
	СписокНазванийДокументов.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокНазванийДокументов.Добавить(Выборка.НазваниеДокумента);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НазваниеДокументаПриИзмененииНаСервере()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ШаблоныНазванийДокументов.НазваниеДокумента КАК НазваниеДокумента,
	               |	ШаблоныНазванийДокументов.РасширениеНазвания КАК РасширениеНазвания
	               |ИЗ
	               |	РегистрСведений.ШаблоныНазванийДокументов КАК ШаблоныНазванийДокументов
	               |ГДЕ
	               |	ШаблоныНазванийДокументов.НазваниеДокумента = &НазваниеДокумента";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НазваниеДокумента", НазваниеДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокРаширенийНазванийДокументов = Элементы.РасширениеНазвания.СписокВыбора;
	СписокРаширенийНазванийДокументов.Очистить();
	Пока Выборка.Следующий() Цикл
		СписокРаширенийНазванийДокументов.Добавить(Выборка.РасширениеНазвания);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеДокументаПриИзменении(Элемент)
	
	РасширениеНазвания = "";
	НазваниеДокументаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ЗначениеЗаполнено(НазваниеДокумента) И ЗначениеЗаполнено(РасширениеНазвания) Тогда
		ПараметрыЗакрытия = Новый Структура;
		НаименованиеДокумента = СтрШаблон("%1 %2", ТРег(НазваниеДокумента), НРег(РасширениеНазвания));
		ПараметрыЗакрытия.Вставить("НаименованиеДокумента", НаименованиеДокумента);
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	Иначе
		ПоказатьПредупреждение(, "Не заполнены все поля.");
	КонецЕсли;
	
КонецПроцедуры
